{
  "common": {
    "name": "javascript",
    "title": "Script Engine",
    "titleLang": {
      "en": "Script Engine",
      "de": "Skriptausführung",
      "ru": "Скрипты",
      "pt": "Script Engine",
      "nl": "Script-engine",
      "fr": "Moteur de script",
      "it": "Motore di script",
      "es": "Motor de script",
      "pl": "Silnik skryptowy",
      "zh-cn": "脚本引擎"
    },
    "authors": [
      "bluefox <dogafox@gmail.com>",
      "hobbyquaker <hq@ccu.io>",
      "Apollon77 <iobroker@fischer-ka.de>",
      "AlCalzone"
    ],
    "version": "5.8.6",
    "news": {
      "5.8.6": {
        "en": "Fixed function edit dialog (cursor jumps to first position)\nAdded error message when using number or boolean as trigger id",
        "de": "Behobene Funktion bearbeiten Dialog (Kursor springt in die erste Position)\nFehlermeldung bei Verwendung von Nummer oder Boolean als Trigger-ID hinzugefügt",
        "ru": "Фиксированный диалог редактирования функции (курсор прыгает в первую позицию)\nДобавлено сообщение об ошибке при использовании номера или boolean как триггер id",
        "pt": "Caixa de diálogo de edição de função fixa (cursor salta para a primeira posição)\nAdicionado mensagem de erro ao usar número ou boolean como gatilho id",
        "nl": "Gerepareerde functie edit dialog (cursor springt naar eerste positie)\nVergissingsbericht bij gebruik van nummer of boolean als trigger",
        "fr": "Boîte de dialogue d'édition de fonction fixe (tailleur saute à la première position)\nAjout du message d'erreur lors de l'utilisation du nombre ou du boolean comme trigger id",
        "it": "Finestra di dialogo Modifica funzione fissa (cursor salta in prima posizione)\nAggiunto messaggio di errore quando si utilizza il numero o boolean come trigger id",
        "es": "Diálogo de edición de funciones fijas (apuntas de precursor a primera posición)\nMensaje de error añadido cuando se utiliza el número o booleano como disparador id",
        "pl": "Kształtowanie funkcji edytowanych (ok\nPoniższa wiadomość błędu przy użyciu numeru lub booleana jako wyzwalanie idyda",
        "zh-cn": "固定功能的口号(头寸)\n在使用人数或诱因时增加错误信息"
      },
      "5.8.5": {
        "en": "Added preparations for cloud",
        "de": "Präparate für die Wolke hinzugefügt",
        "ru": "Добавлена подготовка к облаку",
        "pt": "Preparações adicionadas para a nuvem",
        "nl": "Voegde voorbereidingen voor wolken",
        "fr": "Préparations supplémentaires pour le cloud",
        "it": "Aggiunti i preparativi per il cloud",
        "es": "Preparativos adicionales para la nube",
        "pl": "Zadaniowe przygotowania do chmur",
        "zh-cn": "增加云雾准备"
      },
      "5.8.3": {
        "en": "Updated the object select dialog",
        "de": "Update des Objektauswahldialogs",
        "ru": "Обновление объекта выберите диалог",
        "pt": "Atualizado o objeto selecionar diálogo",
        "nl": "Verhoog het object",
        "fr": "Mise à jour du dialogue de sélection de l'objet",
        "it": "Aggiornato il dialogo selezionare oggetto",
        "es": "Actualizado el diálogo de selección del objeto",
        "pl": "Zaktualizowany obiekt wybiera dialogi",
        "zh-cn": "二. 更新目标"
      },
      "5.8.2": {
        "en": "Updated some packages \nMade it work with ioBroker cloud",
        "de": "Einige Pakete aktualisiert\nEs funktioniert mit ioBroker Cloud",
        "ru": "Обновлены некоторые пакеты\nСделано в ioBroker cloud",
        "pt": "Atualizado alguns pacotes\nFez com que funcionasse com a nuvem ioBroker",
        "nl": "Verhoog wat pakketten\nIk liet het werken met ioBrokerwolk",
        "fr": "Mise à jour de certains paquets\nIl a fait fonctionner avec ioBroker cloud",
        "it": "Aggiornato alcuni pacchetti\nHa fatto funzionare con ioBroker cloud",
        "es": "Actualización de algunos paquetes\nLo hizo funcionar con la nube de yoBroker",
        "pl": "Ulepszenia niektórych pakietów\nUprawiała się w chmurze ioBrokera",
        "zh-cn": "更新了一些一揽子计划\n马约恩岛与奥布罗克云合作"
      },
      "5.8.1": {
        "en": "Allowed to use javascript behind reverse proxy\nIf adapter parameter set to null in `writeFile/readFile`, it will be used `0_userdata.0`",
        "de": "Gestattet, javascript hinter Reverse Proxy zu verwenden\nWenn Adapter-Parameter auf Null in schreibenDatei/readFile gesetzt, wird es 0_userdata.0 verwendet",
        "ru": "Разрешено использовать javascript за обратным прокси\nЕсли параметр адаптера установлен на null в WriteFile/readFile, он будет использоваться 0_userdata.0",
        "pt": "Permitido usar javascript atrás do proxy reverso\nSe o parâmetro adaptador definido para null no writeFile/readFile, ele será usado 0_userdata.0",
        "nl": "Genoemd om javascript te gebruiken achter omgekeerde proxy\nAls de adapter parameter op het niveau staat, wordt het 0userdata gebruikt",
        "fr": "Permet d ' utiliser le javascript derrière le proxy inverse\nSi le paramètre adaptateur est nul dans writeFile/readFile, il sera utilisé 0_userdata.0",
        "it": "Permesso di utilizzare javascript dietro proxy inverso\nSe il parametro dell'adattatore impostato a null in writeFile/readFile, verrà utilizzato 0_userdata.0",
        "es": "Permitido utilizar javascript detrás del proxy inverso\nSi el parámetro adaptador se establece para null en WriteFile/readFile, se utilizará 0_userdata.0",
        "pl": "Wszystko do używania javascriptu za odwrotną proxy\nJeśli parametr adaptujący zostanie ustawiony w pisaniu/czytaniu pliku, zostanie użyty 0_userdata.0",
        "zh-cn": "允许在反常剂后面使用木图。\n如果调整后参数以注销File/pFile,则将使用0._userdata.0。"
      },
      "5.8.0": {
        "en": "Implemented onFile and offFile functions (available with js-controller 4.1+)\nAdd sendToAsync und sendToHostAsync methods\nAdded support of custom rule plugins (actually only telegram)",
        "de": "Implementierte onFile- und offFile-Funktionen (verfügbar mit js-controller 4.1+)\nFügen Sie die Methoden sendToAsync und sendToHostAsync hinzu\nUnterstützung von benutzerdefinierten Regel-Plugins hinzugefügt (eigentlich nur Telegramm)",
        "ru": "Реализованы функции onFile и offFile (доступно с js-контроллером 4.1+)\nДобавьте методы sendToAsync и sendToHostAsync.\nДобавлена поддержка плагинов пользовательских правил (фактически только телеграм)",
        "pt": "Funções onFile e offFile implementadas (disponíveis com js-controller 4.1+)\nAdicionar métodos sendToAsync e sendToHostAsync\nAdicionado suporte de plugins de regras personalizadas (na verdade, apenas telegrama)",
        "nl": "Geïmplementeerde onFile- en offFile-functies (beschikbaar met js-controller 4.1+)\nSendToAsync en sendToHostAsync-methoden toevoegen\nOndersteuning toegevoegd voor plug-ins voor aangepaste regels (eigenlijk alleen telegram)",
        "fr": "Implémentation des fonctions onFile et offFile (disponible avec js-controller 4.1+)\nAjouter les méthodes sendToAsync et sendToHostAsync\nAjout de la prise en charge des plugins de règles personnalisées (en fait uniquement télégramme)",
        "it": "Funzioni onFile e offFile implementate (disponibili con js-controller 4.1+)\nAggiungi i metodi sendToAsync e sendToHostAsync\nAggiunto supporto per plugin di regole personalizzate (in realtà solo telegramma)",
        "es": "Funciones onFile y offFile implementadas (disponibles con js-controller 4.1+)\nAgregar métodos sendToAsync y sendToHostAsync\nSe agregó soporte de complementos de reglas personalizadas (en realidad solo telegrama)",
        "pl": "Zaimplementowane funkcje onFile i offFile (dostępne z kontrolerem js 4.1+)\nDodaj metody sendToAsync i sendToHostAsync\nDodano obsługę wtyczek reguł niestandardowych (właściwie tylko telegram)",
        "zh-cn": "实现了 onFile 和 offFile 函数（js-controller 4.1+ 可用）\n添加 sendToAsync 和 sendToHostAsync 方法\n添加了对自定义规则插件的支持（实际上只有电报）"
      },
      "5.7.0": {
        "en": "Allow sending of messages to scripts also from adapters and CLI by sending \"toScript\" message (see [onMessage Documentation](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md#onmessage))\nLists returned by $-selector are now unified and do not contain double entries \nFix subscribe multiple object ID lists in blockly",
        "de": "Erlauben Sie das Senden von Nachrichten an Skripte auch von Adaptern und CLI, indem Sie eine „toScript“-Nachricht senden (siehe [onMessage Documentation](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md# onmessage))\nVon $-selector zurückgegebene Listen sind jetzt vereinheitlicht und enthalten keine doppelten Einträge\nKorrigieren Sie das Abonnieren mehrerer Objekt-ID-Listen in Blockly",
        "ru": "Разрешить отправку сообщений скриптам также из адаптеров и CLI, отправив сообщение «toScript» (см. [Документацию onMessage](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md# в сообщении))\nСписки, возвращаемые $-селектором, теперь унифицированы и не содержат двойных записей.\nИсправить подписку на несколько списков идентификаторов объектов в блочном режиме.",
        "pt": "Permita o envio de mensagens para scripts também de adaptadores e CLI enviando a mensagem \"toScript\" (consulte [onMessage Documentation](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md# na mensagem))\nAs listas retornadas pelo $-selector agora são unificadas e não contêm entradas duplas\nCorrige a inscrição de várias listas de IDs de objetos em blocos",
        "nl": "Sta het verzenden van berichten naar scripts ook toe vanaf adapters en CLI door een \"toScript\"-bericht te verzenden (zie [onMessage Documentation](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md# een bericht))\nLijsten die worden geretourneerd door $-selector zijn nu verenigd en bevatten geen dubbele invoer\nFix abonneren op meerdere object-ID-lijsten in blockly",
        "fr": "Autoriser l'envoi de messages aux scripts également à partir des adaptateurs et de la CLI en envoyant le message \"toScript\" (voir [onMessage Documentation](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md# sur message))\nLes listes renvoyées par $-selector sont maintenant unifiées et ne contiennent pas de doubles entrées\nCorrection de l'abonnement à plusieurs listes d'ID d'objets en bloc",
        "it": "Consenti l'invio di messaggi agli script anche da adattatori e CLI inviando un messaggio \"toScript\" (vedi [documentazione onMessage](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md# sul messaggio))\nGli elenchi restituiti da $-selector sono ora unificati e non contengono voci doppie\nRisolto il problema con la sottoscrizione di più elenchi di ID oggetto in blocco",
        "es": "Permita el envío de mensajes a scripts también desde adaptadores y CLI enviando un mensaje \"toScript\" (consulte [documentación de onMessage] (https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md#) enmensaje))\nLas listas devueltas por $-selector ahora están unificadas y no contienen entradas dobles\nArreglar suscribirse a múltiples listas de ID de objetos en blockly",
        "pl": "Zezwalaj na wysyłanie wiadomości do skryptów również z adapterów i CLI, wysyłając wiadomość \"toScript\" (patrz [onMessage Documentation](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md# onmessage))\nListy zwracane przez $-selector są teraz ujednolicone i nie zawierają podwójnych wpisów\nNaprawiono subskrybowanie wielu list identyfikatorów obiektów w blokach",
        "zh-cn": "通过发送“toScript”消息，也允许从适配器和 CLI 向脚本发送消息（请参阅 [onMessage 文档](https://github.com/ioBroker/ioBroker.javascript/blob/master/docs/en/javascript.md#留言））\n$-selector 返回的列表现在是统一的并且不包含双重条目\n修复在块中订阅多个对象 ID 列表"
      }
    },
    "desc": {
      "en": "Javascript/Blockly Script Engine for ioBroker",
      "de": "Javascript/Blockly Skriptausführung für ioBroker",
      "ru": "Выполнение Javascript/Blockly скриптов для ioBroker"
    },
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "loglevel": "info",
    "icon": "javascript.png",
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.javascript/master/admin-config/javascript.png",
    "keywords": [
      "js",
      "javascript",
      "typescript",
      "coffeescript",
      "rules",
      "automate",
      "scriptengine",
      "blockly",
      "blokly"
    ],
    "materialize": true,
    "readme": "https://github.com/iobroker/ioBroker.javascript/blob/master/README.md",
    "enabled": true,
    "license": "MIT",
    "compact": true,
    "eraseOnUpload": true,
    "adminTab": {
      "singleton": true,
      "name": {
        "en": "Scripts",
        "de": "Skripte",
        "ru": "Скрипты"
      }
    },
    "docs": {
      "en": [
        "docs/en/javascript.md",
        "docs/en/blockly.md"
      ],
      "ru": [
        "docs/ru/blockly.md"
      ],
      "de": [
        "docs/de/usage.md",
        "docs/de/blockly.md"
      ]
    },
    "dependencies": [
      {
        "js-controller": ">=2.2.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "type": "logic",
    "messagebox": true,
    "logTransporter": true,
    "plugins": {
      "sentry": {
        "dsn": "https://f3b9740caaee4ee69eb68019d71526ff@sentry.iobroker.net/15"
      }
    },
    "tier": 1,
    "connectionType": "none",
    "dataSource": "none",
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<5.5.0",
            "newVersion>=5.5.0"
          ]
        },
        "title": {
          "en": "Check used script mirror path!",
          "de": "Überprüfen Sie den verwendeten Skript-Spiegelpfad!",
          "ru": "Проверьте используемый путь к зеркалу скрипта!",
          "pt": "Verifique o caminho do espelho de script usado!",
          "nl": "Controleer het gebruikte scriptspiegelpad!",
          "fr": "Vérifiez le chemin du miroir de script utilisé !",
          "it": "Controlla il percorso del mirror dello script utilizzato!",
          "es": "¡Compruebe la ruta del espejo del script usado!",
          "pl": "Sprawdź używaną ścieżkę lustrzaną skryptu!",
          "zh-cn": "检查使用的脚本镜像路径！"
        },
        "text": {
          "en": "If the script mirror feature is used to save scripts also in the file system and a directory inside the ioBroker directory is configured, then you need to check if this mirroring location is still allowed! If not the adapter logs an error on startup and mirroring is deactivated! For a list of forbidden locations please check the adapter Readme.",
          "de": "Wenn die Skript-Spiegelungsfunktion verwendet wird, um Skripte auch im Dateisystem zu speichern, und ein Verzeichnis innerhalb des ioBroker-Verzeichnisses konfiguriert ist, muss geprüft werden, ob dieser Spiegelungsspeicherort noch zulässig ist! Andernfalls meldet der Adapter beim Start einen Fehler und die Spiegelung wird deaktiviert! Eine Liste verbotener Orte ist in der Adapter-Readme zu finden.",
          "ru": "Если функция зеркалирования скриптов используется для сохранения скриптов также в файловой системе и настроен каталог внутри каталога ioBroker, то вам необходимо проверить, разрешено ли это местоположение зеркалирования! В противном случае адаптер регистрирует ошибку при запуске, и зеркалирование деактивируется! Список запрещенных мест см. в файле Readme адаптера.",
          "pt": "Se o recurso de espelhamento de script for usado para salvar scripts também no sistema de arquivos e um diretório dentro do diretório ioBroker estiver configurado, você precisará verificar se esse local de espelhamento ainda é permitido! Caso contrário, o adaptador registra um erro na inicialização e o espelhamento é desativado! Para obter uma lista de locais proibidos, verifique o Readme do adaptador.",
          "nl": "Als de functie voor het spiegelen van scripts wordt gebruikt om scripts ook in het bestandssysteem op te slaan en een map in de ioBroker-map is geconfigureerd, moet u controleren of deze spiegellocatie nog steeds is toegestaan! Als dit niet het geval is, registreert de adapter een fout bij het opstarten en is spiegelen gedeactiveerd! Raadpleeg de adapter Readme voor een lijst met verboden locaties.",
          "fr": "Si la fonctionnalité de mise en miroir des scripts est utilisée pour enregistrer également les scripts dans le système de fichiers et qu'un répertoire à l'intérieur du répertoire ioBroker est configuré, vous devez vérifier si cet emplacement de mise en miroir est toujours autorisé ! Si ce n'est pas le cas, l'adaptateur enregistre une erreur au démarrage et la mise en miroir est désactivée ! Pour une liste des emplacements interdits, veuillez consulter le fichier Readme de l'adaptateur.",
          "it": "Se la funzione di mirroring degli script viene utilizzata per salvare gli script anche nel file system ed è configurata una directory all'interno della directory di ioBroker, è necessario verificare se questa posizione di mirroring è ancora consentita! In caso contrario, l'adattatore registra un errore all'avvio e il mirroring è disattivato! Per un elenco delle posizioni vietate, controllare il file Readme dell'adattatore.",
          "es": "Si la función de duplicación de secuencias de comandos se utiliza para guardar secuencias de comandos también en el sistema de archivos y se configura un directorio dentro del directorio de ioBroker, ¡entonces debe verificar si esta ubicación de duplicación todavía está permitida! De lo contrario, el adaptador registra un error al iniciarse y la duplicación se desactiva. Para obtener una lista de ubicaciones prohibidas, consulte el archivo Léame del adaptador.",
          "pl": "Jeśli funkcja kopii lustrzanej skryptów jest używana do zapisywania skryptów również w systemie plików, a katalog w katalogu ioBroker jest skonfigurowany, musisz sprawdzić, czy ta lokalizacja kopii lustrzanej jest nadal dozwolona! Jeśli nie, adapter rejestruje błąd podczas uruchamiania, a dublowanie jest wyłączone! Listę zabronionych lokalizacji można znaleźć w pliku Readme adaptera.",
          "zh-cn": "如果使用脚本镜像功能将脚本也保存在文件系统中，并且配置了 ioBroker 目录内的目录，那么您需要检查该镜像位置是否仍然允许！如果不是，适配器会在启动时记录错误并且镜像被禁用！有关禁止位置的列表，请查看适配器自述文件。"
        },
        "link": "https://github.com/ioBroker/ioBroker.javascript#forbidden-directories-for-script-filesystem-mirroring",
        "level": "warn",
        "linkText": {
          "en": "List of the forbidden Mirror locations",
          "de": "Liste der verbotenen Mirror-Standorte",
          "ru": "Список запрещенных локаций Зеркала",
          "pt": "Lista dos locais de espelho proibidos",
          "nl": "Lijst met de verboden Mirror-locaties",
          "fr": "Liste des emplacements Mirror interdits",
          "it": "Elenco delle posizioni degli specchi proibiti",
          "es": "Lista de las ubicaciones de Mirror prohibidas",
          "pl": "Lista zakazanych lokalizacji Lustrzanych",
          "zh-cn": "禁止镜像位置列表"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "latitude": "",
    "longitude": "",
    "enableSetObject": false,
    "enableSendToHost": false,
    "enableExec": false,
    "libraries": "",
    "libraryTypings": "",
    "subscribe": false,
    "useSystemGPS": true,
    "mirrorPath": "",
    "mirrorInstance": 0,
    "allowSelfSignedCerts": false,
    "sunriseEvent": "nightEnd",
    "sunriseOffset": 0,
    "sunriseLimitStart": "06:00",
    "sunriseLimitEnd": "12:00",
    "sunsetEvent": "dusk",
    "sunsetOffset": 0,
    "sunsetLimitStart": "18:00",
    "sunsetLimitEnd": "23:00"
  },
  "objects": [
    {
      "_id": "_design/script",
      "language": "javascript",
      "views": {
        "javascript": {
          "map": "function(doc) { if (doc.type === 'script' && doc.common.engineType.match(/^[jJ]ava[sS]cript|^[cC]offee[sS]cript|^[tT]ype[sS]cript|^Blockly|^Rules/)) emit(doc.common.name, doc); }"
        }
      }
    },
    {
      "_id": "script.js",
      "common": {
        "name": "js"
      },
      "type": "device",
      "native": {}
    },
    {
      "_id": "script.js.common",
      "common": {
        "name": "common"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "script.js.global",
      "common": {
        "name": "global"
      },
      "type": "channel",
      "native": {}
    }
  ],
  "instanceObjects": [
    {
      "_id": "variables",
      "common": {
        "name": "Useful variables"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "variables.isDayTime",
      "common": {
        "name": "Is day time",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "indicator"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "variables.dayTime",
      "common": {
        "name": "Actual day time",
        "desc": "Like 13:34, you can set native.format12 to true to have 1:32",
        "type": "string",
        "read": true,
        "write": false,
        "role": "state"
      },
      "type": "state",
      "native": {
        "format12": false,
        "leadingZeros": true
      }
    },
    {
      "_id": "variables.rulesTour",
      "common": {
        "name": "Is tour done",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "state"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug",
      "common": {
        "name": "Debug variables"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "debug.to",
      "common": {
        "name": "Send data to debugger",
        "type": "string",
        "read": false,
        "write": true,
        "role": "json"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug.from",
      "common": {
        "name": "Data from debugger",
        "type": "string",
        "read": true,
        "write": false,
        "role": "json"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug.rules",
      "common": {
        "name": "Data from engine to rules",
        "type": "string",
        "read": true,
        "write": false,
        "role": "json"
      },
      "type": "state",
      "native": {}
    }
  ]
}
