{
  "common": {
    "name": "javascript",
    "title": "Script Engine",
    "titleLang": {
      "en": "Script Engine",
      "de": "Skriptausführung",
      "ru": "Скрипты",
      "pt": "Script Engine",
      "nl": "Script-engine",
      "fr": "Moteur de script",
      "it": "Motore di script",
      "es": "Motor de script",
      "pl": "Silnik skryptowy",
      "zh-cn": "脚本引擎"
    },
    "authors": [
      "bluefox <dogafox@gmail.com>",
      "hobbyquaker <hq@ccu.io>",
      "Apollon77 <iobroker@fischer-ka.de>",
      "AlCalzone"
    ],
    "version": "6.1.0",
    "news": {
      "6.1.0": {
        "en": "Add a configurable check for number of setStates per Minute to prevent scripts from taking down ioBroker. Default are 1000 setState per minute. Only stops if the number is reached 2 minutes in a row!\nAdd createAlias method to create aliases for states\nAdd setStateDelayed to selector\nAdd options to exec command\nFix issues with cancelling schedules when stopping scripts\nCorrected debug mode",
        "de": "Fügen Sie eine konfigurierbare Überprüfung für die Anzahl der setStates pro Minute hinzu, um zu verhindern, dass Skripte ioBroker abnehmen. Standard sind 1000 setState pro Minute. Nur stoppt, wenn die Zahl 2 Minuten in Folge erreicht wird!\nFügen Sie createAlias-Methode hinzu, um Alias für Staaten zu erstellen\nSetStateDelayed to selector hinzufügen\nOptionen zum Befehl exec hinzufügen\nBehebt Probleme mit Abbrechen der Termine beim Stoppen von Skripten\nKorrigierter Debug-Modus",
        "ru": "Добавьте конфигурируемую проверку на количество установленных Штат в минуту, чтобы предотвратить скрипты от снятия ioBroker. По умолчанию 1000 setState в минуту. Только останавливается, если число достигнет 2 минуты подряд!\nДобавьте метод созданияAlias для создания псевдонимов для государств\nДобавить setStateЗадержка для селектора\nДобавьте опции в команду exec\nИсправление вопросов с отменой графиков при остановке скриптов\nИсправлен режим отладки",
        "pt": "Adicione uma verificação configurável para o número de setStates per Minute para evitar que os scripts derrubem o ioBroker. Padrão são 1000 setState por minuto. Apenas pára se o número for atingido 2 minutos consecutivos!\nAdicionar método createAlias para criar aliases para estados\nAdicionar setStateDelayed ao seletor\nAdicionar opções ao comando exec\nCorrigir problemas com agendas de cancelamento ao parar scripts\nModo de depuração corrigido",
        "nl": "Voeg een configurabele cheque toe voor een aantal sets per Minute om te voorkomen dat scripten ioBroker neerhalen. Default is 1000 setstate per minuut. Het stopt alleen als het nummer 2 minuten op rij is!\nVoeg Alias methode toe om aliassen te creëren voor staten\nVertaling:\nVoeg de opties toe om commando's te overtreden\nVertaling:\nVertaling:",
        "fr": "Ajouter un contrôle configurable pour le nombre de setStates par Minute pour empêcher les scripts de descendre ioBroker. Les défauts sont de 1000 États par minute. Seulement s'arrête si le nombre est atteint 2 minutes de suite !\nAjouter la méthode createAlias pour créer des alias pour les états\nAjouter le setStateDelayed to selector\nAjouter des options à la commande exec\nCorrection des problèmes avec les horaires d'annulation lors de l'arrêt des scripts\nMode de débogage corrigé",
        "it": "Aggiungi un controllo configurabile per il numero di setStates per Minute per evitare che gli script scendano ioBroker. I default sono 1000 setState al minuto. Si ferma solo se il numero è raggiunto 2 minuti di fila!\nAggiungi il metodo createAlias per creare alias per gli stati\nAggiungi setStateDelayed al selettore\nAggiungere le opzioni al comando exec\nRisolvere i problemi con gli orari di cancellazione quando si fermano gli script\nModalità di debug corretto",
        "es": "Agregue un cheque configurable para el número de estados fijados por minuto para evitar que los scripts derriban ioBroker. Por defecto son 1000 Estados por minuto. Sólo para si el número es alcanzado 2 minutos seguidos!\nAgregar método createAlias para crear alias para los estados\nAñadir setStateDelayed to selector\nAñadir opciones al comando exec\nArreglar problemas con los horarios de cancelación cuando detenga scripts\nModo de depuración corregido",
        "pl": "Addd – konfigurowalny kontrola dla wielu ustaw States per Minute w celu zapobiegania skryptom zamiast ciągników ioBrokera. Uszkodzenia wynosi 1000 punktów na minutę. Zatrzymują się one, jeśli liczba sięga 2 minuty w rzędzie!\nAddd tworzy metodę Aliasa w celu stworzenia aliaz\nAdd setStateDelay\nAdddition to perform command\nZagadnienia z odwołaniem harmonogramów w momencie zatrzymywania scenariuszy\nPoprawka",
        "uk": "Додати конфігураційну перевірку для кількості setStates для запобігання скриптів від зняття ioBroker. За замовчуванням 1000 setState за хвилину. Тільки зупиняється, якщо число досягне 2 хвилин поспіль!\nДодати метод створенняAlias для створення псевдонімів для станів\nДодати setStateDelayed для selector\nДодати параметри до команди exec\nВиправлення питань з графіками скасування при зупинці сценаріїв\nВиправлений режим відключення",
        "zh-cn": "增加一分钟的固定国家数量的易燃检查,以防止言词不致降。 被告每分钟一分钟。 只有停止数以2分钟计的加元!\n增加创设别语的方法\n增 编\n增加特区指挥的选择\n冻结时间表的固定问题\n改编"
      },
      "6.0.3": {
        "en": "Downgrade Typescript to prevent errors with global typescript scripts",
        "de": "Herunterfahren Typescript, um Fehler mit globalen Typscript-Skripten zu verhindern",
        "ru": "Downgrade Typescript для предотвращения ошибок с помощью глобальных сценариев typescript",
        "pt": "Downgrade Typescript para evitar erros com scripts de tipo global",
        "nl": "Downgrade Typescript om fouten te voorkomen met globale scripts",
        "fr": "Typescript de mise à niveau pour éviter les erreurs avec les scripts de typescript mondiaux",
        "it": "Downgrade Typescript per evitare errori con script di tipografia globali",
        "es": "Tiposcript de Downgrade para prevenir errores con scripts de tiposcript globales",
        "pl": "Wspomnienie typu Downgrade (ang. Downgrade Typescript), aby zapobiec błędom w tworzeniu scenariusza globalnego",
        "zh-cn": "D. 防止全球表格错误的等级说明"
      },
      "6.0.2": {
        "en": "Downgrade Typescript to prevent errors with global typescript scripts",
        "de": "Herunterfahren Typescript, um Fehler mit globalen Typscript-Skripten zu verhindern",
        "ru": "Downgrade Typescript для предотвращения ошибок с помощью глобальных сценариев typescript",
        "pt": "Downgrade Typescript para evitar erros com scripts de tipo global",
        "nl": "Downgrade Typescript om fouten te voorkomen met globale scripts",
        "fr": "Typescript de mise à niveau pour éviter les erreurs avec les scripts de typescript mondiaux",
        "it": "Downgrade Typescript per evitare errori con script di tipografia globali",
        "es": "Tiposcript de Downgrade para prevenir errores con scripts de tiposcript globales",
        "pl": "Wspomnienie typu Downgrade (ang. Downgrade Typescript), aby zapobiec błędom w tworzeniu scenariusza globalnego",
        "zh-cn": "D. 防止全球表格错误的等级说明"
      },
      "6.0.1": {
        "en": "Fixed the wizard schedule\nDone small fixes on GUI",
        "de": "Der Wizard Zeitplan wurde behoben\nFertige kleine Korrekturen auf GUI",
        "ru": "Исправлено расписание мастера\nНебольшие исправления на GUI",
        "pt": "Corrigido o cronograma do assistente\nFeito pequenas correções em GUI",
        "nl": "Het tovenaarschema is klaar\nGereed met kleine fixes op GUI",
        "fr": "Correction de l'horaire de l'assistant\nFait de petites corrections sur GUI",
        "it": "Risolto il programma della procedura guidata\nFatto piccole correzioni su GUI",
        "es": "Arreglado el programa del mago\nHecho pequeñas correcciones en GUI",
        "pl": "Fixed wizard schedule (ang.)\nDo niewielkich zmian na GUI",
        "zh-cn": "确定妻子时间表\nA. 古伊人小偷"
      },
      "6.0.0": {
        "en": "Removed support of coffeescript\nAll coffee-scripts will be compiled to javascript permanently",
        "de": "Entfernte Unterstützung von Coffeescript\nAlle Coffee-scripts werden in Javascript dauerhaft kompiliert",
        "ru": "Удаленная поддержка Coffeescript\nВсе кофейные скрипты будут компилированы на javascript навсегда",
        "pt": "Suporte removido do coffeescript\nTodos os coffee-scripts serão compilados para javascript permanentemente",
        "nl": "Verwijderde ondersteuning van koffie\nAlle koffie-scripten zullen permanent op Javascript staan",
        "fr": "Enlevé le support de caféscript\nTous les descriptifs de café seront compilés à javascript en permanence",
        "it": "Sostegno rimosso del coffeescript\nTutti i coffee-script saranno compilati a javascript in modo permanente",
        "es": "Soporte extraído de cafetera\nTodas las recetas de café serán compiladas en javascript permanentemente",
        "pl": "Przewiduje wsparcie kawy\nWszystkie zapisy kawy zostały skompilowane na stałe",
        "zh-cn": "取消对咖啡说明的支持\n将把所有咖啡说明汇编成永久的小册子。"
      },
      "5.8.10": {
        "en": "Added variable timeout block\nAdded `getInterval` and `getTimeout` blocks\nAdded `sendTo` for scripts and message trigger blocks\nCorrected the syntax highlighting",
        "de": "Hinzugefügt variable Timeout Block\nHinzugefügt getInterval und getTimeout Blöcke\nHinzugefügt: Für Skripte und Nachrichten-Triggerblöcke\nKorrektur der Syntax-Highlighting",
        "ru": "Добавлен переменный блок timeout\nДобавлены getInterval и getTimeout блоки\nДобавлена отправка Для скриптов и сообщений триггер блоков\nИсправлена подсветка синтаксиса",
        "pt": "Adicionado bloco de tempo limite variável\nAdicionado getInterval e getTimeout blocos\nAdicionado enviar Para scripts e blocos de gatilho de mensagem\nCorrigido o destaque da sintaxe",
        "nl": "Vertaling:\nGevoegd bij het krijgen van Timeout blokken\nVertaling: Naar scripts en berichten\nVertaling:",
        "fr": "Ajout d'un timeout variable\nAjouté getInterval and getTimeout blocks\nAjouté Pour les scripts et les blocs de déclenchement de message\nCorrection de la syntaxe",
        "it": "Aggiunto blocco timeout variabile\nAggiunto getInterval e getTimeout blocchi\nAggiunto il messaggio A per gli script e blocchi di trigger dei messaggi\nCorretto l'evidenziazione della sintassi",
        "es": "Bloque de tiempo variable\nAñadido getInterval and getTimeout bloques\nEnviar Para para scripts y bloques de activación de mensajes\nCorregido la sintaxis resaltando",
        "pl": "Zmienna czasowa\nAdded getInterval and getTime blocks (ang.)\nAdded sender Dla skryptów i wiadomości blokuje bloki skryptów\nKwalifikacje podkreślają składnię",
        "zh-cn": "增加变量的时间限制\n增加联接和后政权的陷阱\n增 发 说明和讯息触发因素\n更正了总括号内。"
      },
      "5.8.9": {
        "en": "Added variable timeout block\nAdded `getInterval` and `getTimeout` blocks\nAdded `sendTo` for scripts and message trigger blocks",
        "de": "Hinzugefügt variable Timeout Block\nHinzugefügt getInterval und getTimeout Blöcke\nHinzugefügt: Für Skripte und Nachrichten-Triggerblöcke",
        "ru": "Добавлен переменный блок timeout\nДобавлены getInterval и getTimeout блоки\nДобавлена отправка Для скриптов и сообщений триггер блоков",
        "pt": "Adicionado bloco de tempo limite variável\nAdicionado getInterval e getTimeout blocos\nAdicionado enviar Para scripts e blocos de gatilho de mensagem",
        "nl": "Vertaling:\nGevoegd bij het krijgen van Timeout blokken\nVertaling: Naar scripts en berichten",
        "fr": "Ajout d'un timeout variable\nAjouté getInterval and getTimeout blocks\nAjouté Pour les scripts et les blocs de déclenchement de message",
        "it": "Aggiunto blocco timeout variabile\nAggiunto getInterval e getTimeout blocchi\nAggiunto il messaggio A per gli script e blocchi di trigger dei messaggi",
        "es": "Bloque de tiempo variable\nAñadido getInterval and getTimeout bloques\nEnviar Para para scripts y bloques de activación de mensajes",
        "pl": "Zmienna czasowa\nAdded getInterval and getTime blocks (ang.)\nAdded sender Dla skryptów i wiadomości blokuje bloki skryptów",
        "zh-cn": "增加变量的时间限制\n增加联接和后政权的陷阱\n增 发 说明和讯息触发因素"
      }
    },
    "desc": {
      "en": "Javascript/Blockly Script Engine for ioBroker",
      "de": "Javascript/Blockly Skriptausführung für ioBroker",
      "ru": "Выполнение Javascript/Blockly скриптов для ioBroker"
    },
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "loglevel": "info",
    "icon": "javascript.png",
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.javascript/master/admin-config/javascript.png",
    "keywords": [
      "js",
      "javascript",
      "typescript",
      "coffeescript",
      "rules",
      "automate",
      "scriptengine",
      "blockly",
      "blokly"
    ],
    "materialize": true,
    "readme": "https://github.com/iobroker/ioBroker.javascript/blob/master/README.md",
    "enabled": true,
    "license": "MIT",
    "compact": true,
    "eraseOnUpload": true,
    "adminTab": {
      "singleton": true,
      "name": {
        "en": "Scripts",
        "de": "Skripte",
        "ru": "Скрипты"
      }
    },
    "docs": {
      "en": [
        "docs/en/javascript.md",
        "docs/en/blockly.md"
      ],
      "ru": [
        "docs/ru/blockly.md"
      ],
      "de": [
        "docs/de/usage.md",
        "docs/de/blockly.md"
      ]
    },
    "dependencies": [
      {
        "js-controller": ">=2.2.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "type": "logic",
    "messagebox": true,
    "logTransporter": true,
    "plugins": {
      "sentry": {
        "dsn": "https://f3b9740caaee4ee69eb68019d71526ff@sentry.iobroker.net/15"
      }
    },
    "tier": 1,
    "connectionType": "none",
    "dataSource": "none",
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<5.5.0",
            "newVersion>=5.5.0"
          ]
        },
        "title": {
          "en": "Check used script mirror path!",
          "de": "Überprüfen Sie den verwendeten Skript-Spiegelpfad!",
          "ru": "Проверьте используемый путь к зеркалу скрипта!",
          "pt": "Verifique o caminho do espelho de script usado!",
          "nl": "Controleer het gebruikte scriptspiegelpad!",
          "fr": "Vérifiez le chemin du miroir de script utilisé !",
          "it": "Controlla il percorso del mirror dello script utilizzato!",
          "es": "¡Compruebe la ruta del espejo del script usado!",
          "pl": "Sprawdź używaną ścieżkę lustrzaną skryptu!",
          "zh-cn": "检查使用的脚本镜像路径！"
        },
        "text": {
          "en": "If the script mirror feature is used to save scripts also in the file system and a directory inside the ioBroker directory is configured, then you need to check if this mirroring location is still allowed! If not the adapter logs an error on startup and mirroring is deactivated! For a list of forbidden locations please check the adapter Readme.",
          "de": "Wenn die Skript-Spiegelungsfunktion verwendet wird, um Skripte auch im Dateisystem zu speichern, und ein Verzeichnis innerhalb des ioBroker-Verzeichnisses konfiguriert ist, muss geprüft werden, ob dieser Spiegelungsspeicherort noch zulässig ist! Andernfalls meldet der Adapter beim Start einen Fehler und die Spiegelung wird deaktiviert! Eine Liste verbotener Orte ist in der Adapter-Readme zu finden.",
          "ru": "Если функция зеркалирования скриптов используется для сохранения скриптов также в файловой системе и настроен каталог внутри каталога ioBroker, то вам необходимо проверить, разрешено ли это местоположение зеркалирования! В противном случае адаптер регистрирует ошибку при запуске, и зеркалирование деактивируется! Список запрещенных мест см. в файле Readme адаптера.",
          "pt": "Se o recurso de espelhamento de script for usado para salvar scripts também no sistema de arquivos e um diretório dentro do diretório ioBroker estiver configurado, você precisará verificar se esse local de espelhamento ainda é permitido! Caso contrário, o adaptador registra um erro na inicialização e o espelhamento é desativado! Para obter uma lista de locais proibidos, verifique o Readme do adaptador.",
          "nl": "Als de functie voor het spiegelen van scripts wordt gebruikt om scripts ook in het bestandssysteem op te slaan en een map in de ioBroker-map is geconfigureerd, moet u controleren of deze spiegellocatie nog steeds is toegestaan! Als dit niet het geval is, registreert de adapter een fout bij het opstarten en is spiegelen gedeactiveerd! Raadpleeg de adapter Readme voor een lijst met verboden locaties.",
          "fr": "Si la fonctionnalité de mise en miroir des scripts est utilisée pour enregistrer également les scripts dans le système de fichiers et qu'un répertoire à l'intérieur du répertoire ioBroker est configuré, vous devez vérifier si cet emplacement de mise en miroir est toujours autorisé ! Si ce n'est pas le cas, l'adaptateur enregistre une erreur au démarrage et la mise en miroir est désactivée ! Pour une liste des emplacements interdits, veuillez consulter le fichier Readme de l'adaptateur.",
          "it": "Se la funzione di mirroring degli script viene utilizzata per salvare gli script anche nel file system ed è configurata una directory all'interno della directory di ioBroker, è necessario verificare se questa posizione di mirroring è ancora consentita! In caso contrario, l'adattatore registra un errore all'avvio e il mirroring è disattivato! Per un elenco delle posizioni vietate, controllare il file Readme dell'adattatore.",
          "es": "Si la función de duplicación de secuencias de comandos se utiliza para guardar secuencias de comandos también en el sistema de archivos y se configura un directorio dentro del directorio de ioBroker, ¡entonces debe verificar si esta ubicación de duplicación todavía está permitida! De lo contrario, el adaptador registra un error al iniciarse y la duplicación se desactiva. Para obtener una lista de ubicaciones prohibidas, consulte el archivo Léame del adaptador.",
          "pl": "Jeśli funkcja kopii lustrzanej skryptów jest używana do zapisywania skryptów również w systemie plików, a katalog w katalogu ioBroker jest skonfigurowany, musisz sprawdzić, czy ta lokalizacja kopii lustrzanej jest nadal dozwolona! Jeśli nie, adapter rejestruje błąd podczas uruchamiania, a dublowanie jest wyłączone! Listę zabronionych lokalizacji można znaleźć w pliku Readme adaptera.",
          "zh-cn": "如果使用脚本镜像功能将脚本也保存在文件系统中，并且配置了 ioBroker 目录内的目录，那么您需要检查该镜像位置是否仍然允许！如果不是，适配器会在启动时记录错误并且镜像被禁用！有关禁止位置的列表，请查看适配器自述文件。"
        },
        "link": "https://github.com/ioBroker/ioBroker.javascript#forbidden-directories-for-script-filesystem-mirroring",
        "level": "warn",
        "linkText": {
          "en": "List of the forbidden Mirror locations",
          "de": "Liste der verbotenen Mirror-Standorte",
          "ru": "Список запрещенных локаций Зеркала",
          "pt": "Lista dos locais de espelho proibidos",
          "nl": "Lijst met de verboden Mirror-locaties",
          "fr": "Liste des emplacements Mirror interdits",
          "it": "Elenco delle posizioni degli specchi proibiti",
          "es": "Lista de las ubicaciones de Mirror prohibidas",
          "pl": "Lista zakazanych lokalizacji Lustrzanych",
          "zh-cn": "禁止镜像位置列表"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "latitude": "",
    "longitude": "",
    "enableSetObject": false,
    "enableSendToHost": false,
    "enableExec": false,
    "libraries": "",
    "libraryTypings": "",
    "subscribe": false,
    "useSystemGPS": true,
    "mirrorPath": "",
    "mirrorInstance": 0,
    "allowSelfSignedCerts": false,
    "sunriseEvent": "nightEnd",
    "sunriseOffset": 0,
    "sunriseLimitStart": "06:00",
    "sunriseLimitEnd": "12:00",
    "sunsetEvent": "dusk",
    "sunsetOffset": 0,
    "sunsetLimitStart": "18:00",
    "sunsetLimitEnd": "23:00",
    "maxSetStatePerMinute": 1000
  },
  "objects": [
    {
      "_id": "_design/script",
      "language": "javascript",
      "views": {
        "javascript": {
          "map": "function(doc) { if (doc.type === 'script' && doc.common.engineType.match(/^[jJ]ava[sS]cript|^[cC]offee[sS]cript|^[tT]ype[sS]cript|^Blockly|^Rules/)) emit(doc.common.name, doc); }"
        }
      }
    },
    {
      "_id": "script.js",
      "common": {
        "name": "js"
      },
      "type": "device",
      "native": {}
    },
    {
      "_id": "script.js.common",
      "common": {
        "name": "common"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "script.js.global",
      "common": {
        "name": "global"
      },
      "type": "channel",
      "native": {}
    }
  ],
  "instanceObjects": [
    {
      "_id": "variables",
      "common": {
        "name": "Useful variables"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "variables.isDayTime",
      "common": {
        "name": "Is day time",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "indicator"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "variables.dayTime",
      "common": {
        "name": "Actual day time",
        "desc": "Like 13:34, you can set native.format12 to true to have 1:32",
        "type": "string",
        "read": true,
        "write": false,
        "role": "state"
      },
      "type": "state",
      "native": {
        "format12": false,
        "leadingZeros": true
      }
    },
    {
      "_id": "variables.rulesTour",
      "common": {
        "name": "Is tour done",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "state"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug",
      "common": {
        "name": "Debug variables"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "debug.to",
      "common": {
        "name": "Send data to debugger",
        "type": "string",
        "read": false,
        "write": true,
        "role": "json"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug.from",
      "common": {
        "name": "Data from debugger",
        "type": "string",
        "read": true,
        "write": false,
        "role": "json"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug.rules",
      "common": {
        "name": "Data from engine to rules",
        "type": "string",
        "read": true,
        "write": false,
        "role": "json"
      },
      "type": "state",
      "native": {}
    }
  ]
}
