{
  "common": {
    "name": "javascript",
    "title": "Script Engine",
    "titleLang": {
      "en": "Script Engine",
      "de": "Skriptausführung",
      "ru": "Скрипты",
      "pt": "Script Engine",
      "nl": "Script-engine",
      "fr": "Moteur de script",
      "it": "Motore di script",
      "es": "Motor de script",
      "pl": "Silnik skryptowy",
      "zh-cn": "脚本引擎"
    },
    "authors": [
      "bluefox <dogafox@gmail.com>",
      "hobbyquaker <hq@ccu.io>",
      "Apollon77 <iobroker@fischer-ka.de>",
      "AlCalzone"
    ],
    "version": "5.5.1",
    "news": {
      "5.5.1": {
        "en": "Added new rules action block: sum two states (or minus)",
        "de": "Neuer Aktionsblock für Regeln hinzugefügt: Summiere zwei Zustände (oder minus)",
        "ru": "Добавлен новый блок действий правил: суммировать два состояния (или минус)",
        "pt": "Adicionado novo bloco de ação de regras: soma dois estados (ou menos)",
        "nl": "Nieuw actieblok voor regels toegevoegd: som twee toestanden (of min) op",
        "fr": "Ajout d'un nouveau bloc d'action de règles : somme de deux états (ou moins)",
        "it": "Aggiunto nuovo blocco azione regole: somma due stati (o meno)",
        "es": "Se agregó un nuevo bloque de acción de reglas: suma dos estados (o menos)",
        "pl": "Dodano nowy blok akcji reguł: zsumuj dwa stany (lub minus)",
        "zh-cn": "添加了新的规则动作块：将两个状态相加（或减去）"
      },
      "5.5.0": {
        "en": "Prevent Mirror directory being set to central ioBroker directories because can produce various issues\nFixed existsState and existsObject\nFixed translations",
        "de": "Verhindern Sie, dass das Spiegelverzeichnis auf zentrale ioBroker-Verzeichnisse eingestellt wird, da dies zu verschiedenen Problemen führen kann\nExistiertState und ExistiertObjekt behoben\nÜbersetzungen korrigiert",
        "ru": "Предотвратить настройку каталога зеркала на центральные каталоги ioBroker, поскольку это может привести к различным проблемам.\nИсправлены existsState и existsObject\nИсправлены переводы",
        "pt": "Impedir que o diretório Mirror seja definido como diretórios centrais do ioBroker, pois pode produzir vários problemas\nCorrigido existState e existObject\nTraduções fixas",
        "nl": "Voorkom dat Mirror-directory wordt ingesteld op centrale ioBroker-directories, omdat dit verschillende problemen kan veroorzaken\nVaste existState en existObject\nVaste vertalingen",
        "fr": "Empêcher que le répertoire miroir ne soit défini sur les répertoires centraux ioBroker, car cela peut entraîner divers problèmes\nCorrection de l'état de l'état et de l'objet de l'existence\nTraductions fixes",
        "it": "Impedisci che la directory Mirror venga impostata su directory ioBroker centrali perché può produrre vari problemi\nRisolto il problema esisteState ed esisteOggetto\nTraduzioni fisse",
        "es": "Evite que el directorio Mirror se establezca en directorios centrales de ioBroker porque puede producir varios problemas\nSe corrigió el estado y el objeto existentes.\nTraducciones fijas",
        "pl": "Zapobiegaj ustawianiu katalogu Mirror na centralne katalogi ioBroker, ponieważ może to powodować różne problemy\nNaprawiono istniejeStan i istniejeObject\nNaprawiono tłumaczenia",
        "zh-cn": "防止将镜像目录设置为中央 ioBroker 目录，因为可能会产生各种问题\n修复了 existsState 和 existsObject\n固定翻译"
      },
      "5.4.5": {
        "en": "Fix existsState and existsObject",
        "de": "ExistiertState und ExistiertObjekt korrigiert",
        "ru": "Исправление existsState и existsObject",
        "pt": "Correção de existState e existObject",
        "nl": "Bestaande Staat en ExistObject repareren",
        "fr": "Correction de l'état de l'état et de l'objet de l'existence",
        "it": "Risolto il problema esiste Stato ed Esiste Oggetto",
        "es": "Repara existState y existeObject",
        "pl": "Napraw stan istnieje i istniejeObject",
        "zh-cn": "修复 existsState 和 existsObject"
      },
      "5.4.3": {
        "en": "Fix handling of month schedules with given date list\nOptimize scheduling to make sure to not miss triggers if callbacks would need too long",
        "de": "Behandlung von Monatsplänen mit gegebener Datumsliste korrigiert\nOptimieren Sie die Planung, um sicherzustellen, dass Sie keine Trigger verpassen, wenn Rückrufe zu lange dauern würden",
        "ru": "Исправлена обработка месячных расписаний с заданным списком дат.\nОптимизируйте планирование, чтобы не пропустить триггеры, если обратные вызовы потребуются слишком долго.",
        "pt": "Corrige o manuseio de agendamentos mensais com uma lista de datas fornecida\nOtimize o agendamento para garantir que não perca os acionadores se os retornos de chamada precisarem de muito tempo",
        "nl": "Afhandeling van maandschema's met gegeven datumlijst repareren\nOptimaliseer de planning om ervoor te zorgen dat u geen triggers mist als terugbellen te lang zou duren",
        "fr": "Correction de la gestion des horaires mensuels avec une liste de dates donnée\nOptimisez la planification pour vous assurer de ne pas manquer les déclencheurs si les rappels prendraient trop de temps",
        "it": "Risolto il problema con la gestione delle pianificazioni mensili con l'elenco delle date specificato\nOttimizza la pianificazione per assicurarti di non perdere i trigger se i callback richiedessero troppo tempo",
        "es": "Arreglar el manejo de los horarios mensuales con la lista de fechas dada\nOptimice la programación para asegurarse de no perder los disparadores si las devoluciones de llamadas necesitaran demasiado tiempo",
        "pl": "Naprawiono obsługę harmonogramów miesięcznych z podaną listą dat\nZoptymalizuj harmonogram, aby nie przegapić wyzwalaczy, jeśli wywołania zwrotne będą wymagały zbyt dużo czasu",
        "zh-cn": "使用给定的日期列表修复月份时间表的处理\n优化调度以确保在回调需要太长时间时不会错过触发器"
      },
      "5.4.2": {
        "en": "Fix automatic start of Rules scripts when starting adapter",
        "de": "Automatisches Starten von Regelskripten beim Start des Adapters behoben",
        "ru": "Исправлен автоматический запуск скриптов Rules при запуске адаптера.",
        "pt": "Corrige o início automático de scripts de regras ao iniciar o adaptador",
        "nl": "Automatische start van Regelscripts repareren bij het starten van de adapter",
        "fr": "Correction du démarrage automatique des scripts de règles lors du démarrage de l'adaptateur",
        "it": "Risolto il problema con l'avvio automatico degli script delle regole all'avvio dell'adattatore",
        "es": "Arreglar el inicio automático de los scripts de reglas al iniciar el adaptador",
        "pl": "Napraw automatyczne uruchamianie skryptów reguł podczas uruchamiania adaptera",
        "zh-cn": "修复启动适配器时规则脚本的自动启动"
      },
      "5.4.1": {
        "en": "Fix blockly subscribes broken in 5.4.0",
        "de": "In 5.4.0 fehlerhafte Blockly-Abonnements behoben",
        "ru": "Исправить блочную подписку, сломанную в 5.4.0",
        "pt": "Corrigir assinaturas em bloco quebradas no 5.4.0",
        "nl": "Repareer blockly-abonnementen verbroken in 5.4.0",
        "fr": "Correction des abonnements bloqués cassés dans 5.4.0",
        "it": "Risolto il problema con gli abbonamenti bloccati interrotti nella 5.4.0",
        "es": "Arreglar suscripciones bloqueadas rotas en 5.4.0",
        "pl": "Napraw blokowe subskrypcje zepsute w 5.4.0",
        "zh-cn": "修复 5.4.0 中损坏的块订阅"
      },
      "5.4.0": {
        "en": "Automatically create missing folder objects when states are created using createState\nFix special characters in blockly subscribe logic\nFix timing issue where state updates could not be current on startup\nFix state name handing\nFix potential crash cases reported by Sentry",
        "de": "Automatisches Erstellen fehlender Ordnerobjekte, wenn Zustände mit createState erstellt werden\nKorrigieren Sie Sonderzeichen in der Blockly-Subscribe-Logik\nBehebung eines Zeitproblems, bei dem Statusaktualisierungen beim Start nicht aktuell sein konnten\nKorrigieren Sie die Übergabe von Staatsnamen\nBeheben Sie potenzielle Absturzfälle, die von Sentry gemeldet wurden",
        "ru": "Автоматически создавать отсутствующие объекты папок при создании состояний с помощью createState.\nИсправление специальных символов в логике блочной подписки\nИсправлена ошибка синхронизации, из-за которой обновления состояния не могли быть текущими при запуске.\nИсправить передачу имени штата\nИсправить потенциальные случаи сбоев, о которых сообщает Sentry.",
        "pt": "Crie automaticamente objetos de pasta ausentes quando os estados forem criados usando createState\nCorrige caracteres especiais na lógica de assinatura em bloco\nCorrige o problema de tempo em que as atualizações de estado não podiam ser atualizadas na inicialização\nCorrigir a entrega do nome do estado\nCorrigir possíveis casos de travamento relatados pelo Sentinela",
        "nl": "Automatisch ontbrekende mapobjecten maken wanneer staten worden gemaakt met createState\nSpeciale tekens corrigeren in logica voor blokkering van abonnementen\nProbleem met timing oplossen waarbij statusupdates niet actueel konden zijn bij het opstarten\nOverhandigen van staatsnaam repareren\nHerstel mogelijke crashgevallen gemeld door Sentry",
        "fr": "Créer automatiquement des objets de dossier manquants lors de la création d'états à l'aide de createState\nCorrection des caractères spéciaux dans la logique d'abonnement en bloc\nCorrection d'un problème de synchronisation où les mises à jour d'état ne pouvaient pas être à jour au démarrage\nCorrection de la gestion du nom de l'état\nCorrection des cas de plantage potentiels signalés par Sentry",
        "it": "Crea automaticamente oggetti cartella mancanti quando gli stati vengono creati utilizzando createState\nCorreggi i caratteri speciali nella logica di sottoscrizione a blocchi\nRisolto il problema dei tempi per cui gli aggiornamenti di stato non potevano essere aggiornati all'avvio\nRisolto il problema con la consegna del nome dello stato\nRisolvi potenziali casi di crash segnalati da Sentry",
        "es": "Cree automáticamente objetos de carpeta que faltan cuando se crean estados usando createState\nArreglar caracteres especiales en la lógica de suscripción en bloque\nSolucionar el problema de tiempo donde las actualizaciones de estado no podían estar actualizadas al inicio\nArreglar la entrega de nombres de estado\nSolucionar posibles casos de bloqueo informados por Sentry",
        "pl": "Automatycznie twórz brakujące obiekty folderów, gdy stany są tworzone za pomocą createState\nNapraw znaki specjalne w logice blokowania subskrypcji\nNapraw problem z czasem, w którym aktualizacje stanu nie mogą być aktualne podczas uruchamiania\nNapraw przekazywanie nazwy stanu\nNapraw potencjalne awarie zgłoszone przez Sentry",
        "zh-cn": "使用 createState 创建状态时自动创建缺少的文件夹对象\n修复块订阅逻辑中的特殊字符\n修复启动时状态更新无法为最新的计时问题\n修复状态名称处理\n修复 Sentry 报告的潜在崩溃案例"
      }
    },
    "desc": {
      "en": "Javascript/Blockly Script Engine for ioBroker",
      "de": "Javascript/Blockly Skriptausführung für ioBroker",
      "ru": "Выполнение Javascript/Blockly скриптов для ioBroker"
    },
    "platform": "Javascript/Node.js",
    "mode": "daemon",
    "loglevel": "info",
    "icon": "javascript.png",
    "extIcon": "https://raw.githubusercontent.com/ioBroker/ioBroker.javascript/master/admin-config/javascript.png",
    "keywords": [
      "js",
      "javascript",
      "typescript",
      "coffeescript",
      "rules",
      "automate",
      "scriptengine",
      "blockly",
      "blokly"
    ],
    "materialize": true,
    "readme": "https://github.com/iobroker/ioBroker.javascript/blob/master/README.md",
    "enabled": true,
    "license": "MIT",
    "compact": true,
    "eraseOnUpload": true,
    "adminTab": {
      "singleton": true,
      "name": {
        "en": "Scripts",
        "de": "Skripte",
        "ru": "Скрипты"
      }
    },
    "docs": {
      "en": [
        "docs/en/javascript.md",
        "docs/en/blockly.md"
      ],
      "ru": [
        "docs/ru/blockly.md"
      ],
      "de": [
        "docs/de/usage.md",
        "docs/de/blockly.md"
      ]
    },
    "dependencies": [
      {
        "js-controller": ">=2.2.0"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.1.28"
      }
    ],
    "type": "logic",
    "messagebox": true,
    "logTransporter": true,
    "plugins": {
      "sentry": {
        "dsn": "https://f3b9740caaee4ee69eb68019d71526ff@sentry.iobroker.net/15"
      }
    },
    "tier": 1,
    "connectionType": "none",
    "dataSource": "none",
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<5.5.0",
            "newVersion>=5.5.0"
          ]
        },
        "title": {
          "en": "Check used script mirror path!",
          "de": "Überprüfen Sie den verwendeten Skript-Spiegelpfad!",
          "ru": "Проверьте используемый путь к зеркалу скрипта!",
          "pt": "Verifique o caminho do espelho de script usado!",
          "nl": "Controleer het gebruikte scriptspiegelpad!",
          "fr": "Vérifiez le chemin du miroir de script utilisé !",
          "it": "Controlla il percorso del mirror dello script utilizzato!",
          "es": "¡Compruebe la ruta del espejo del script usado!",
          "pl": "Sprawdź używaną ścieżkę lustrzaną skryptu!",
          "zh-cn": "检查使用的脚本镜像路径！"
        },
        "text": {
          "en": "If the script mirror feature is used to save scripts also in the file system and a directory inside the ioBroker directory is configured, then you need to check if this mirroring location is still allowed! If not the adapter logs an error on startup and mirroring is deactivated! For a list of forbidden locations please check the adapter Readme.",
          "de": "Wenn die Skript-Spiegelungsfunktion verwendet wird, um Skripte auch im Dateisystem zu speichern, und ein Verzeichnis innerhalb des ioBroker-Verzeichnisses konfiguriert ist, muss geprüft werden, ob dieser Spiegelungsspeicherort noch zulässig ist! Andernfalls meldet der Adapter beim Start einen Fehler und die Spiegelung wird deaktiviert! Eine Liste verbotener Orte ist in der Adapter-Readme zu finden.",
          "ru": "Если функция зеркалирования скриптов используется для сохранения скриптов также в файловой системе и настроен каталог внутри каталога ioBroker, то вам необходимо проверить, разрешено ли это местоположение зеркалирования! В противном случае адаптер регистрирует ошибку при запуске, и зеркалирование деактивируется! Список запрещенных мест см. в файле Readme адаптера.",
          "pt": "Se o recurso de espelhamento de script for usado para salvar scripts também no sistema de arquivos e um diretório dentro do diretório ioBroker estiver configurado, você precisará verificar se esse local de espelhamento ainda é permitido! Caso contrário, o adaptador registra um erro na inicialização e o espelhamento é desativado! Para obter uma lista de locais proibidos, verifique o Readme do adaptador.",
          "nl": "Als de functie voor het spiegelen van scripts wordt gebruikt om scripts ook in het bestandssysteem op te slaan en een map in de ioBroker-map is geconfigureerd, moet u controleren of deze spiegellocatie nog steeds is toegestaan! Als dit niet het geval is, registreert de adapter een fout bij het opstarten en is spiegelen gedeactiveerd! Raadpleeg de adapter Readme voor een lijst met verboden locaties.",
          "fr": "Si la fonctionnalité de mise en miroir des scripts est utilisée pour enregistrer également les scripts dans le système de fichiers et qu'un répertoire à l'intérieur du répertoire ioBroker est configuré, vous devez vérifier si cet emplacement de mise en miroir est toujours autorisé ! Si ce n'est pas le cas, l'adaptateur enregistre une erreur au démarrage et la mise en miroir est désactivée ! Pour une liste des emplacements interdits, veuillez consulter le fichier Readme de l'adaptateur.",
          "it": "Se la funzione di mirroring degli script viene utilizzata per salvare gli script anche nel file system ed è configurata una directory all'interno della directory di ioBroker, è necessario verificare se questa posizione di mirroring è ancora consentita! In caso contrario, l'adattatore registra un errore all'avvio e il mirroring è disattivato! Per un elenco delle posizioni vietate, controllare il file Readme dell'adattatore.",
          "es": "Si la función de duplicación de secuencias de comandos se utiliza para guardar secuencias de comandos también en el sistema de archivos y se configura un directorio dentro del directorio de ioBroker, ¡entonces debe verificar si esta ubicación de duplicación todavía está permitida! De lo contrario, el adaptador registra un error al iniciarse y la duplicación se desactiva. Para obtener una lista de ubicaciones prohibidas, consulte el archivo Léame del adaptador.",
          "pl": "Jeśli funkcja kopii lustrzanej skryptów jest używana do zapisywania skryptów również w systemie plików, a katalog w katalogu ioBroker jest skonfigurowany, musisz sprawdzić, czy ta lokalizacja kopii lustrzanej jest nadal dozwolona! Jeśli nie, adapter rejestruje błąd podczas uruchamiania, a dublowanie jest wyłączone! Listę zabronionych lokalizacji można znaleźć w pliku Readme adaptera.",
          "zh-cn": "如果使用脚本镜像功能将脚本也保存在文件系统中，并且配置了 ioBroker 目录内的目录，那么您需要检查该镜像位置是否仍然允许！如果不是，适配器会在启动时记录错误并且镜像被禁用！有关禁止位置的列表，请查看适配器自述文件。"
        },
        "link": "https://github.com/ioBroker/ioBroker.javascript#forbidden-directories-for-script-filesystem-mirroring",
        "level": "warn",
        "linkText": {
          "en": "List of the forbidden Mirror locations",
          "de": "Liste der verbotenen Mirror-Standorte",
          "ru": "Список запрещенных локаций Зеркала",
          "pt": "Lista dos locais de espelho proibidos",
          "nl": "Lijst met de verboden Mirror-locaties",
          "fr": "Liste des emplacements Mirror interdits",
          "it": "Elenco delle posizioni degli specchi proibiti",
          "es": "Lista de las ubicaciones de Mirror prohibidas",
          "pl": "Lista zakazanych lokalizacji Lustrzanych",
          "zh-cn": "禁止镜像位置列表"
        },
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "latitude": "",
    "longitude": "",
    "enableSetObject": false,
    "enableSendToHost": false,
    "enableExec": false,
    "libraries": "",
    "libraryTypings": "",
    "subscribe": false,
    "useSystemGPS": true,
    "mirrorPath": "",
    "mirrorInstance": 0,
    "allowSelfSignedCerts": false,
    "sunriseEvent": "nightEnd",
    "sunriseOffset": 0,
    "sunriseLimitStart": "06:00",
    "sunriseLimitEnd": "12:00",
    "sunsetEvent": "dusk",
    "sunsetOffset": 0,
    "sunsetLimitStart": "18:00",
    "sunsetLimitEnd": "23:00"
  },
  "objects": [
    {
      "_id": "_design/script",
      "language": "javascript",
      "views": {
        "javascript": {
          "map": "function(doc) { if (doc.type === 'script' && doc.common.engineType.match(/^[jJ]ava[sS]cript|^[cC]offee[sS]cript|^[tT]ype[sS]cript|^Blockly|^Rules/)) emit(doc.common.name, doc); }"
        }
      }
    },
    {
      "_id": "script.js",
      "common": {
        "name": "js"
      },
      "type": "device",
      "native": {}
    },
    {
      "_id": "script.js.common",
      "common": {
        "name": "common"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "script.js.global",
      "common": {
        "name": "global"
      },
      "type": "channel",
      "native": {}
    }
  ],
  "instanceObjects": [
    {
      "_id": "variables",
      "common": {
        "name": "Useful variables"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "variables.isDayTime",
      "common": {
        "name": "Is day time",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "indicator"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "variables.dayTime",
      "common": {
        "name": "Actual day time",
        "desc": "Like 13:34, you can set native.format12 to true to have 1:32",
        "type": "string",
        "read": true,
        "write": false,
        "role": "state"
      },
      "type": "state",
      "native": {
        "format12": false,
        "leadingZeros": true
      }
    },
    {
      "_id": "variables.rulesTour",
      "common": {
        "name": "Is tour done",
        "type": "boolean",
        "read": true,
        "write": false,
        "role": "state"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug",
      "common": {
        "name": "Debug variables"
      },
      "type": "channel",
      "native": {}
    },
    {
      "_id": "debug.to",
      "common": {
        "name": "Send data to debugger",
        "type": "string",
        "read": false,
        "write": true,
        "role": "json"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug.from",
      "common": {
        "name": "Data from debugger",
        "type": "string",
        "read": true,
        "write": false,
        "role": "json"
      },
      "type": "state",
      "native": {}
    },
    {
      "_id": "debug.rules",
      "common": {
        "name": "Data from engine to rules",
        "type": "string",
        "read": true,
        "write": false,
        "role": "json"
      },
      "type": "state",
      "native": {}
    }
  ]
}
